meliksahaltuntas/NucleoWB55/Projects/NUCLEO_BLE_TEST/Projects/P-NUCLEO-WB55.Nucleo/Applications/BLE/BLE_p2pClient/STM32CubeIDE/Application/User/STM32_WPAN/App/app_ble.c
          case ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE:
            {
              /* USER CODE BEGIN RADIO_ACTIVITY_EVENT */
              BSP_LED_On(LED_GREEN);
              HW_TS_Start(BleApplicationContext.SwitchOffGPIO_timer_Id, (uint32_t)LED_ON_TIMEOUT);
              /* USER CODE END RADIO_ACTIVITY_EVENT */
            }
            break; /* ACI_HAL_END_OF_RADIO_ACTIVITY_VSEVT_CODE */
  #endif

          /* USER CODE BEGIN BLUE_EVT */

          /* USER CODE END BLUE_EVT */

          default:
            /* USER CODE BEGIN ecode_default */

            /* USER CODE END ecode_default */
            break;
        }
      }
      break;

    case HCI_DISCONNECTION_COMPLETE_EVT_CODE:
        if (cc->Connection_Handle == BleApplicationContext.BleApplicationContext_legacy.connectionHandle) {
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = 0;
            BleApplicationContext.Device_Connection_Status = APP_BLE_IDLE;

            /* USER CODE BEGIN EVT_DISCONN_COMPLETE */
            APP_DBG_MSG("=== CLIENT: DISCONNECTED FROM SERVER ===\n");
            APP_DBG_MSG("Data transfer completed successfully\n");
            APP_DBG_MSG("Restarting scan in 3 seconds...\n");

            // LED: Kırmızı - Disconnected, scanning'e hazır
            BSP_LED_On(LED_RED);
            BSP_LED_Off(LED_GREEN);
            BSP_LED_Off(LED_BLUE);
            /* USER CODE END EVT_DISCONN_COMPLETE */

            // P2P disconnection notification
            handleNotification.P2P_Evt_Opcode = PEER_DISCON_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);
        }
        break;

    case HCI_LE_META_EVT_CODE:
      {
        /* USER CODE BEGIN EVT_LE_META_EVENT */

        /* USER CODE END EVT_LE_META_EVENT */
        meta_evt = (evt_le_meta_event*) event_pckt->data;

        switch (meta_evt->subevent)
        {
          /* USER CODE BEGIN subevent */

          /* USER CODE END subevent */

        case HCI_LE_CONNECTION_COMPLETE_SUBEVT_CODE:
            connection_complete_event = (hci_le_connection_complete_event_rp0 *) meta_evt->data;
            BleApplicationContext.BleApplicationContext_legacy.connectionHandle = connection_complete_event->Connection_Handle;
            BleApplicationContext.Device_Connection_Status = APP_BLE_CONNECTED_CLIENT;

            /* USER CODE BEGIN EVT_LE_CONN_COMPLETE */
            APP_DBG_MSG("=== CLIENT: CONNECTED TO SERVER ===\n");
            APP_DBG_MSG("Connected to server: %s\n", target_device_name);
            APP_DBG_MSG("Connection handle: 0x%04X\n", connection_complete_event->Connection_Handle);

            // LED: Yeşil - Server'a bağlandı
            BSP_LED_Off(LED_RED);
            BSP_LED_On(LED_GREEN);
            BSP_LED_Off(LED_BLUE);
            /* USER CODE END EVT_LE_CONN_COMPLETE */

            // P2P connection notification
            handleNotification.P2P_Evt_Opcode = PEER_CONN_HANDLE_EVT;
            handleNotification.ConnectionHandle = BleApplicationContext.BleApplicationContext_legacy.connectionHandle;
            P2PC_APP_Notification(&handleNotification);

            // GATT service discovery başlat
            result = aci_gatt_disc_all_primary_services(BleApplicationContext.BleApplicationContext_legacy.connectionHandle);
            if (result == BLE_STATUS_SUCCESS) {
                APP_DBG_MSG("Starting GATT service discovery...\n");
            }
            break;
          case HCI_LE_ADVERTISING_REPORT_SUBEVT_CODE:
          {
              le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;
              uint8_t *adv_report_data;
              uint8_t event_data_size;

              /* Sadece boştayken cihaz ara */
              if (BleApplicationContext.Device_Connection_Status == APP_BLE_IDLE) {
                  adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
                  event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

                  if (Check_Device_Name(adv_report_data, event_data_size)) {
                      BleApplicationContext.DeviceServerFound = 0x01;
                      SERVER_REMOTE_ADDR_TYPE = le_advertising_event->Advertising_Report[0].Address_Type;

                      /* Server adresini kaydet */
                      for(int i = 0; i < 6; i++) {
                          SERVER_REMOTE_BDADDR[i] = le_advertising_event->Advertising_Report[0].Address[i];
                      }

                      APP_DBG_MSG("-- CLIENT FOUND TARGET DEVICE --\n");
                  }
              }

          break;
              /* USER CODE END EVT_LE_ADVERTISING_REPORT */
              le_advertising_event = (hci_le_advertising_report_event_rp0 *) meta_evt->data;

              event_type = le_advertising_event->Advertising_Report[0].Event_Type;

              event_data_size = le_advertising_event->Advertising_Report[0].Length_Data;

              /* WARNING: be careful when decoding advertising report as its raw format cannot be mapped on a C structure.
              The data and RSSI values could not be directly decoded from the RAM using the data and RSSI field from hci_le_advertising_report_event_rp0 structure.
              Instead they must be read by using offsets (please refer to BLE specification).
              RSSI = (int8_t)*(uint8_t*) (adv_report_data + le_advertising_event->Advertising_Report[0].Length_Data);
              */
              adv_report_data = (uint8_t*)(&le_advertising_event->Advertising_Report[0].Length_Data) + 1;
              k = 0;

              /* search AD TYPE 0x09 (Complete Local Name) */
              /* search AD Type 0x02 (16 bits UUIDS) */
              if (event_type == ADV_IND)
              {
                /* ISOLATION OF BD ADDRESS AND LOCAL NAME */

                while(k < event_data_size)
                {
                  adlength = adv_report_data[k];
                  adtype = adv_report_data[k + 1];
                  switch (adtype)
                  {
                    case AD_TYPE_FLAGS: /* now get flags */
                      /* USER CODE BEGIN AD_TYPE_FLAGS */

                      /* USER CODE END AD_TYPE_FLAGS */
                      break;

